<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width,initial-scale=1">
    <title>Patterns in practice :: Neo4j Labs Docs</title>
    <link rel="stylesheet" href="../../../_/css/site.css">
  </head>
  <body class="article docs">
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/labs/docs">
        <svg width="97px" height="36px" viewBox="0 0 97 36" class="logo">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g transform="translate(0.000000, 1.000000)" fill-rule="nonzero">
              <g>
                <path
                  d="M28.7331787,15.4086598 C28.7331787,23.4004124 22.3016241,29.8779381 14.3665893,29.8779381 C6.43155452,29.8779381 0,23.4004124 0,15.4086598 C0,7.41690722 6.43155452,0.939375765 14.3665893,0.939375765 C22.3016241,0.932371134 28.7331787,7.41690722 28.7331787,15.4086598"
                  fill="#008CC1"></path>
                <path
                  d="M6.36890951,10.6626804 C6.36890951,11.3006186 5.85382831,11.8193814 5.22041763,11.8193814 C4.58700696,11.8193814 4.07192575,11.3006186 4.07192575,10.6626804 C4.07192575,10.0247423 4.58700696,9.50597938 5.22041763,9.50597938 C5.86078886,9.50597938 6.36890951,10.0247423 6.36890951,10.6626804"
                  fill="#FFFFFF"></path>
                <path
                  d="M6.5638051,13.8383505 C6.5638051,14.4762887 6.0487239,14.9950515 5.41531323,14.9950515 C4.78190255,14.9950515 4.26682135,14.4762887 4.26682135,13.8383505 C4.26682135,13.2004124 4.78190255,12.6816495 5.41531323,12.6816495 C6.0487239,12.6816495 6.5638051,13.1934021 6.5638051,13.8383505"
                  fill="#FFFFFF"></path>
                <path
                  d="M7.26682135,17.203299 C7.26682135,17.8412371 6.75174014,18.36 6.11832947,18.36 C5.48491879,18.36 4.96983759,17.8412371 4.96983759,17.203299 C4.96983759,16.5653608 5.48491879,16.0465979 6.11832947,16.0465979 C6.75174014,16.0395876 7.26682135,16.5583505 7.26682135,17.203299"
                  fill="#FFFFFF"></path>
                <path
                  d="M8.83990719,20.217732 C8.83990719,20.8556701 8.32482599,21.374433 7.69141531,21.374433 C7.05800464,21.374433 6.54292343,20.8556701 6.54292343,20.217732 C6.54292343,19.5797938 7.05800464,19.0610309 7.69141531,19.0610309 C8.32482599,19.0540206 8.83990719,19.5727835 8.83990719,20.217732"
                  fill="#FFFFFF"></path>
                <path
                  d="M21.1392111,24.4309278 C21.1392111,25.068866 20.6241299,25.5876289 19.9907193,25.5876289 C19.3573086,25.5876289 18.8422274,25.068866 18.8422274,24.4309278 C18.8422274,23.7929897 19.3573086,23.2742268 19.9907193,23.2742268 C20.6241299,23.2742268 21.1392111,23.7929897 21.1392111,24.4309278"
                  fill="#FFFFFF"></path>
                <path
                  d="M23.2273782,21.942268 C23.2273782,22.5802062 22.712297,23.0989691 22.0788863,23.0989691 C21.4454756,23.0989691 20.9303944,22.5802062 20.9303944,21.942268 C20.9303944,21.3043299 21.4454756,20.785567 22.0788863,20.785567 C22.712297,20.785567 23.2273782,21.3043299 23.2273782,21.942268"
                  fill="#FFFFFF"></path>
                <path
                  d="M17.1716937,4.34639175 C17.1716937,4.9843299 16.6566125,5.50309278 16.0232019,5.50309278 C15.3897912,5.50309278 14.87471,4.9843299 14.87471,4.34639175 C14.87471,3.70845361 15.3897912,3.18969072 16.0232019,3.18969072 C16.6566125,3.18969072 17.1716937,3.70845361 17.1716937,4.34639175"
                  fill="#FFFFFF"></path>
                <path
                  d="M14.1508121,3.28082474 C14.1508121,3.91876289 13.6357309,4.43752577 13.0023202,4.43752577 C12.3689095,4.43752577 11.8538283,3.91876289 11.8538283,3.28082474 C11.8538283,2.6428866 12.3689095,2.12412371 13.0023202,2.12412371 C13.6357309,2.12412371 14.1508121,2.6428866 14.1508121,3.28082474"
                  fill="#FFFFFF"></path>
                <ellipse id="Oval" stroke="#FFFFFF" fill="#66B245" cx="22.2946636" cy="11.9595876" rx="7.65661253"
                  ry="7.71134021"></ellipse>
                <ellipse id="Oval" stroke="#FFFFFF" fill="#66B245" cx="11.8051044" cy="27.6837113" rx="6.26450116"
                  ry="6.30927835"></ellipse>
                <ellipse id="Oval" stroke="#FFFFFF" fill="#66B245" cx="6.64733179" cy="4.20618557" rx="4.17633411"
                  ry="4.20618557"></ellipse>
              </g>
              <g id="neo4j" transform="translate(33.000000, 1.000000)" fill="#000000">
                <path
                  d="M0,4.87252125 L1.39130435,4.87252125 L1.39130435,7.6203966 C2.05913043,5.9490085 3.45043478,4.64589235 6.28869565,4.64589235 C9.51652174,4.64589235 11.6869565,6.85552408 11.6869565,10.3399433 L11.6869565,19.1501416 L10.2956522,19.1501416 L10.2956522,10.6232295 C10.2956522,7.76203966 8.57043478,5.97733711 5.9826087,5.97733711 C3.17217391,5.97733711 1.39130435,8.18696884 1.39130435,11.4730878 L1.39130435,19.1501416 L0,19.1501416 L0,4.87252125 Z">
                </path>
                <path
                  d="M14.1634783,12.0396601 C14.1634783,7.59206799 17.1408696,4.5325779 21.0086957,4.5325779 C24.8208696,4.5325779 27.52,7.73371105 27.52,11.6430595 C27.52,11.6430595 27.52,12.0679887 27.4921739,12.3512748 L15.5269565,12.3512748 C15.6104348,15.7790368 17.8643478,18.2152975 21.0643478,18.2152975 C23.68,18.2152975 25.4886957,17.082153 26.3234783,16.0056657 L26.3234783,17.6770538 C25.0156522,18.8668555 23.4295652,19.5467422 21.0643478,19.5467422 C17.0295652,19.5467422 14.1634783,16.5439093 14.1634783,12.1246459 L14.1634783,12.0396601 Z M26.0452174,11.0764873 C26.0173913,8.15864023 23.7913043,5.86402266 21.0086957,5.86402266 C18.0869565,5.86402266 15.693913,8.15864023 15.5826087,11.0764873 L26.0452174,11.0764873 Z">
                </path>
                <path
                  d="M37.0643478,4.50424929 C41.1826087,4.50424929 44.4382609,7.70538244 44.4382609,12.0113314 C44.4382609,16.3172805 41.1826087,19.5184136 37.0643478,19.5184136 C32.946087,19.5184136 29.6904348,16.3172805 29.6904348,12.0113314 C29.6904348,7.70538244 32.946087,4.50424929 37.0643478,4.50424929 Z M37.0643478,18.1869688 C40.4869565,18.1869688 43.0469565,15.5240793 43.0469565,12.0113314 C43.0469565,8.49858357 40.4869565,5.83569405 37.0643478,5.83569405 C33.6417391,5.83569405 31.0817391,8.49858357 31.0817391,12.0113314 C31.0817391,15.5240793 33.6417391,18.1869688 37.0643478,18.1869688 Z">
                </path>
                <polygon
                  points="51.7843478 4.87252125 53.3426087 4.87252125 47.3878261 17.7903683 56.0417391 17.7903683 56.0417391 13.1161473 57.4886957 13.1161473 57.4886957 24.6175637 56.0417391 24.6175637 56.0417391 19.1501416 45.1895652 19.1501416">
                </polygon>
                <path
                  d="M62.2469565,4.87252125 L63.6382609,4.87252125 L63.6382609,21.1331445 C63.6382609,24.3342776 61.8295652,24.9858357 60.0765217,24.9858357 C59.7426087,24.9858357 59.3808696,24.9575071 59.1582609,24.9008499 L59.1582609,23.5694051 C59.4921739,23.6260623 59.8817391,23.6543909 60.2156522,23.6543909 C61.6347826,23.6543909 62.2469565,22.9461756 62.2469565,21.1331445 L62.2469565,4.87252125 Z M61.9408696,1.04815864 C61.9408696,0.45325779 62.413913,0.0283286119 62.9426087,0.0283286119 C63.4713043,0.0283286119 63.9443478,0.45325779 63.9443478,1.04815864 C63.9443478,1.61473088 63.4713043,2.03966006 62.9426087,2.03966006 C62.413913,2.03966006 61.9408696,1.61473088 61.9408696,1.04815864 Z">
                </path>
              </g>
            </g>
          </g>
        </svg>

        <svg width="58px" height="34px" viewBox="0 0 58 34">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">

            <path
              d="M7.204,20.364 C10.088,20.364 12.216,18.768 12.804,17.06 L12.804,20 L14.204,20 L14.204,0.484 L12.804,0.484 L12.804,8.828 C12.216,7.12 10.088,5.524 7.204,5.524 C3.256,5.524 0.092,8.688 0.092,12.944 C0.092,17.2 3.228,20.364 7.204,20.364 Z M7.204,19.048 C3.956,19.048 1.492,16.416 1.492,12.944 C1.492,9.5 3.956,6.84 7.204,6.84 C10.48,6.84 12.972,9.388 12.972,12.944 C12.972,16.5 10.48,19.048 7.204,19.048 Z M23.416,20.364 C27.56,20.364 30.836,17.2 30.836,12.944 C30.836,8.688 27.56,5.524 23.416,5.524 C19.272,5.524 15.996,8.688 15.996,12.944 C15.996,17.2 19.272,20.364 23.416,20.364 Z M23.416,19.048 C19.972,19.048 17.396,16.416 17.396,12.944 C17.396,9.472 19.972,6.84 23.416,6.84 C26.86,6.84 29.436,9.472 29.436,12.944 C29.436,16.416 26.86,19.048 23.416,19.048 Z M40.412,20.364 C42.54,20.364 44.416,19.58 45.76,18.152 L44.92,17.2 C43.8,18.376 42.204,19.048 40.412,19.048 C36.968,19.048 34.392,16.416 34.392,12.944 C34.392,9.472 36.968,6.84 40.412,6.84 C42.204,6.84 43.8,7.512 44.92,8.688 L45.76,7.736 C44.416,6.308 42.54,5.524 40.412,5.524 C36.268,5.524 32.992,8.688 32.992,12.944 C32.992,17.2 36.268,20.364 40.412,20.364 Z M52.424,20.308 C55.588,20.308 57.156,18.46 57.156,16.416 C57.156,14.12 55.7,13.084 53.012,11.992 C51.08,11.208 49.792,10.564 49.792,8.996 C49.792,7.68 50.884,6.84 52.312,6.84 C53.572,6.84 54.384,7.372 54.916,8.324 L56.064,7.736 C55.308,6.28 54.02,5.524 52.284,5.524 C50.044,5.524 48.392,6.952 48.392,8.996 C48.392,11.264 49.96,12.16 52.144,13.084 C54.468,14.064 55.756,14.68 55.756,16.416 C55.756,17.676 54.888,18.992 52.424,18.992 C50.212,18.992 48.896,17.9 48.364,16.444 L47.188,16.892 C47.86,19.076 49.848,20.308 52.424,20.308 Z"
              id="docs" fill="#606060" fill-rule="nonzero" id="docs"></path>
          </g>
        </svg>
      </a>
      <button class="navbar-burger" data-target="topbar-nav">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
      <div class="navbar-end">

        <div class="navbar-item is-hoverable developer">
          <a class="navbar-link" href="/developer">Developer Guides</a>
        </div>
        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project" href="">
              <a class="project-name" href="">Operations Manual</a>

              <ul class="project-links">
                <li><a href="" class="project-link">Migration Guide</a></li>
                <li><a href="" class="project-link">Status Codes</a></li>
              </ul>
            </div>
            <div class="navbar-item project" href="">
              <a class="project-name" href="">Cypher Manual</a>

              <ul class="project-links">
                <li><a href="" class="project-link">Cyper Refcard</a></li>
              </ul>
            </div>
            <div class="navbar-item project" href="">
              <a class="project-name" href="">Driver Manual</a>

              <ul class="project-links">
                <li><a href="" class="project-link">Java</a></li>
                <li><a href="" class="project-link">JavaScript</a></li>
                <li><a href="" class="project-link">.NET</a></li>
                <li><a href="" class="project-link">Python</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc">APOC</a>
              <p class="project-description">A library of procedures and functions for interacting with Neo4j</p>

              <ul class="project-links">
                <li><a href="/labs/apoc/4.0" class="project-link">Documentation</a></li>
                <li><a href="/labs/apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/streams">Neo4j Streams</a>
              <p class="project-description">Integration for Neo4j &amp; Kafka</p>

              <ul class="project-links">
                <li><a href="/labs/streams/4.0" class="project-link">Documentation</a></li>
                <li><a href="/labs/streams" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics">neosemantics</a>
              <p class="project-description">An RDF Toolkit for Neo4j</p>

              <ul class="project-links">
                <li><a href="/labs/neosemantics/4.0" class="project-link">Documentation</a></li>
                <li><a href="/labs/neosemantics" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item">
          <a class="navbar-link" href="/search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" xmlns="http://www.w3.org/2000/svg"
              xmlns:xlink="http://www.w3.org/1999/xlink" class="fill-current float-right" id="search" role="button"
              title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle id="Oval"
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" id="Shape"></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header><div class="search" id="search">
    <div class="search-container">
        <form class="search-form">
            <label for="search_input">Search Neo4j.com</label>

            <input id="search_input" type="text" name="search"
                placeholder="Try &quot;MATCH clause&quot; or &quot;Monitoring Queries&quot;">
            <div class="search-icon">
                <svg width="16px" height="22px" viewBox="0 0 23 23" version="1.1" xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" class="fill-current float-right" id="submit_search"
                    role="button" title="Search Website">
                    <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                        stroke-linejoin="round">
                        <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                            <circle id="Oval"
                                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                            <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" id="Shape"></path>
                        </g>
                    </g>
                </svg>
            </div>
            <div class="search-icon">
                <svg width="14px" height="22px" viewBox="0 0 22 22" role="button" class="cancel" id="close_search">
                    <line x1="19.5833333" y1="0.416666667" x2="0.416666667" y2="19.5833333"></line>
                    <line x1="19.5833333" y1="19.5833333" x2="0.416666667" y2="0.416666667"></line>
                </svg>
            </div>
        </form>
        <div class="search-results"></div>

        <div class="search-filters hidden">
            <div class="search-filters-header">
                <h2>Filter By Category</h2>
                <div class="search-filters-icon">
                    <svg width="14px" height="22px" viewBox="0 0 22 22" role="button" class="cancel" id="close_filters">
                        <line x1="19.5833333" y1="0.416666667" x2="0.416666667" y2="19.5833333"></line>
                        <line x1="19.5833333" y1="19.5833333" x2="0.416666667" y2="0.416666667"></line>
                    </svg>
                </div>
            </div>

            <div class="search-filters-content">
            </div>
        </div>

    </div>
</div><div class="body">
<div class="nav-container" data-component="getting-started" data-version="4.0">
  <aside class="nav">
    <div class="panels">
<div class="nav-panel-menu is-active" data-panel="menu">
  <nav class="nav-menu">
    <h3 class="title"><a href="../index.html">Getting Started</a></h3>
<ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../index.html">The Neo4j Getting Started Guide v4.0</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../get-started-with-neo4j.html">Get started with Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../get-started-with-neo4j.html#_installing_neo4j">Installing Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../get-started-with-neo4j.html#_documentation_guide">Documentation guide</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../graphdb-concepts.html">Graph Database Concepts</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-example-graph">Example Graph</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-nodes">Nodes</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-labels">Labels</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-relationships">Relationships</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-relationship-types">Relationship Types</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-properties">Properties</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-traversal">Traversals and Paths</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-schema">Schema</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-naming-rules-and-recommendations">Naming Rules and Recommendations</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="index.html">Cypher</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="patterns.html">Patterns</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="patterns-in-practice.html">Patterns in practice</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="results.html">Getting the correct results</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="compose-statements.html">Composing large statements</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="schema.html">Defining a schema</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="load-csv.html">Import data</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
<button class="nav-toggle"></button>
<nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../index.html">Getting Started</a></li>
    <li><a href="index.html">Cypher</a></li>
    <li><a href="patterns-in-practice.html">Patterns in practice</a></li>
  </ul>
</nav>
<div class="page-versions">
  <button class="version-menu-toggle" title="Show other versions of page">4.0</button>
  <div class="version-menu">
    <a class="version" href="../../current/cypher-intro/patterns-in-practice.html">current</a>
    <a class="version is-current" href="patterns-in-practice.html">4.0</a>
  </div>
</div>
  <div class="edit-this-page"><a href="https://github.com/neo-technology/neo4j-manual-modeling-antora/edit/4.0/gettingStarted/modules/ROOT/pages/cypher-intro/patterns-in-practice.adoc">Edit this Page</a></div>
  </div>
  <div class="content">
<article class="doc">
<h1 class="page">Patterns in practice</h1>
<div id="preamble">
<div class="sectionbody">
<div class="quoteblock abstract">
<blockquote>
<div class="paragraph">
<p>This section describes how patterns are used in practice</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>This section includes:</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="#cypher-intro-patterns-in-practice-creating-data">Creating data</a></p>
</li>
<li>
<p><a href="#cypher-intro-patterns-in-practice-matching-patterns">Matching patterns</a></p>
</li>
<li>
<p><a href="#cypher-intro-patterns-in-practice-attaching-structures">Attaching structures</a></p>
</li>
<li>
<p><a href="#cypher-intro-patterns-in-practice-completing-patterns">Completing patterns</a></p>
</li>
</ul>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-creating-data"><a class="anchor" href="#cypher-intro-patterns-in-practice-creating-data"></a>Creating data</h2>
<div class="sectionbody">
<div class="paragraph">
<p>We&#8217;ll start by looking into the clauses that allow us to create data.</p>
</div>
<div class="paragraph">
<p>To add data, we just use the patterns we already know.
By providing patterns we can specify what graph structures, labels and properties we would like to make part of our graph.</p>
</div>
<div class="paragraph">
<p>Obviously the simplest clause is called <code>CREATE</code>.
It will just go ahead and directly create the patterns that you specify.</p>
</div>
<div class="paragraph">
<p>For the patterns we&#8217;ve looked at so far this could look like the following:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (:Movie { title:"The Matrix",released:1997 })</code></pre>
</div>
</div>
<div class="paragraph">
<p>If we execute this statement, Cypher returns the number of changes, in this case adding 1 node, 1 label and 2 properties.</p>
</div>
<div class="listingblock">
<div class="content">
<pre>+-------------------+
| No data returned. |
+-------------------+
Nodes created: 1
Properties set: 2
Labels added: 1</pre>
</div>
</div>
<div class="paragraph">
<p>As we started out with an empty database, we now have a database with a single node in it:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N0 [
    label = "{Movie|title = \'The Matrix\'\lreleased = 1997\l}"
  ]</pre>
</div>
</div>
<div class="paragraph">
<p>If case we also want to return the created data we can add a <code>RETURN</code> clause, which refers to the variable we&#8217;ve assigned to our pattern elements.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (p:Person { name:"Keanu Reeves", born:1964 })
RETURN p</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is what gets returned:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>+----------------------------------------+
| p                                      |
+----------------------------------------+
| Node[1]{name:"Keanu Reeves",born:1964} |
+----------------------------------------+
1 row
Nodes created: 1
Properties set: 2
Labels added: 1</pre>
</div>
</div>
<div class="paragraph">
<p>If we want to create more than one element, we can separate the elements with commas or use multiple <code>CREATE</code> statements.</p>
</div>
<div class="paragraph">
<p>We can of course also create more complex structures, like an <code>ACTED_IN</code> relationship with information about the character, or <code>DIRECTED</code> ones for the director.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (a:Person { name:"Tom Hanks",
  born:1956 })-[r:ACTED_IN { roles: ["Forrest"]}]-&gt;(m:Movie { title:"Forrest Gump",released:1994 })
CREATE (d:Person { name:"Robert Zemeckis", born:1951 })-[:DIRECTED]-&gt;(m)
RETURN a,d,r,m</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the part of the graph we just updated:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N2 [
    label = "{Person|name = \'Tom Hanks\'\lborn = 1956\l}"
  ]
  N2 -&gt; N3 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "ACTED_IN\nroles = \[\'Forrest\'\]\l"
  ]
  N3 [
    label = "{Movie|title = \'Forrest Gump\'\lreleased = 1994\l}"
  ]
  N4 -&gt; N3 [
    color = "#4e9a06"
    fontcolor = "#4e9a06"
    label = "DIRECTED\n"
  ]
  N4 [
    label = "{Person|name = \'Robert Zemeckis\'\lborn = 1951\l}"
  ]</pre>
</div>
</div>
<div class="paragraph">
<p>In most cases, we want to connect new data to existing structures.
This requires that we know how to find existing patterns in our graph data, which we will look at next.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-matching-patterns"><a class="anchor" href="#cypher-intro-patterns-in-practice-matching-patterns"></a>Matching patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Matching patterns is a task for the <code>MATCH</code> statement.
We pass the same kind of patterns we&#8217;ve used so far to <code>MATCH</code> to describe what we&#8217;re looking for.
It is similar to <em>query by example</em>, only that our examples also include the structures.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
A <code>MATCH</code> statement will search for the patterns we specify and return <em>one row per successful pattern match</em>.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To find the data we&#8217;ve created so far, we can start looking for all nodes labeled with the <code>Movie</code> label.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie)
RETURN m</code></pre>
</div>
</div>
<div class="paragraph">
<p>Here&#8217;s the result:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N0 [
    label = "{Movie|title = \'The Matrix\'\lreleased = 1997\l}"
  ]
  N1 [
    label = "{Movie|title = \'Forrest Gump\'\lreleased = 1994\l}"
  ]</pre>
</div>
</div>
<div class="paragraph">
<p>This should show both <em>The Matrix</em> and <em>Forrest Gump</em>.</p>
</div>
<div class="paragraph">
<p>We can also look for a specific person, like <em>Keanu Reeves</em>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person { name:"Keanu Reeves" })
RETURN p</code></pre>
</div>
</div>
<div class="paragraph">
<p>This query returns the matching node:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N0 [
    label = "{Person|name = \'Keanu Reeves\'\lborn = 1964\l}"
  ]</pre>
</div>
</div>
<div class="paragraph">
<p>Note that we only provide enough information to find the nodes, not all properties are required.
In most cases you have key-properties like SSN, ISBN, emails, logins, geolocation or product codes to look for.</p>
</div>
<div class="paragraph">
<p>We can also find more interesting connections, like for instance the movies titles that <em>Tom Hanks</em> acted in and the roles he played.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person { name:"Tom Hanks" })-[r:ACTED_IN]-&gt;(m:Movie)
RETURN m.title, r.roles</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+------------------------------+
| m.title        | r.roles     |
+------------------------------+
| "Forrest Gump" | ["Forrest"] |
+------------------------------+
1 row</pre>
</div>
</div>
<div class="paragraph">
<p>In this case we only returned the properties of the nodes and relationships that we were interested in.
You can access them everywhere via a dot notation <code>identifer.property</code>.</p>
</div>
<div class="paragraph">
<p>Of course this only lists his role as <em>Forrest</em> in <em>Forrest Gump</em> because that&#8217;s all data that we&#8217;ve added.</p>
</div>
<div class="paragraph">
<p>Now we know enough to connect new nodes to existing ones and can combine <code>MATCH</code> and <code>CREATE</code> to attach structures to the graph.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-attaching-structures"><a class="anchor" href="#cypher-intro-patterns-in-practice-attaching-structures"></a>Attaching structures</h2>
<div class="sectionbody">
<div class="paragraph">
<p>To extend the graph with new information, we first match the existing connection points and then attach the newly created nodes to them with relationships.
Adding <em>Cloud Atlas</em> as a new movie for <em>Tom Hanks</em> could be achieved like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person { name:"Tom Hanks" })
CREATE (m:Movie { title:"Cloud Atlas",released:2012 })
CREATE (p)-[r:ACTED_IN { roles: ['Zachry']}]-&gt;(m)
RETURN p,r,m</code></pre>
</div>
</div>
<div class="paragraph">
<p>Here&#8217;s what the structure looks like in the database:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N2 [
    label = "{Person|name = \'Tom Hanks\'\lborn = 1956\l}"
  ]
  N2 -&gt; N5 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "ACTED_IN\nroles = \[\'Zachry\'\]\l"
  ]
  N5 [
    label = "{Movie|title = \'Cloud Atlas\'\lreleased = 2012\l}"
  ]</pre>
</div>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
It is important to remember that we can assign variables to both nodes and relationships and use them later on, no matter if they were created or matched.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>It is possible to attach both node and relationship in a single <code>CREATE</code> clause.
For readability it helps to split them up though.</p>
</div>
<div class="admonitionblock important">
<table>
<tr>
<td class="icon">
<i class="fa icon-important" title="Important"></i>
</td>
<td class="content">
A tricky aspect of the combination of <code>MATCH</code> and <code>CREATE</code> is that we get <em>one row per matched pattern</em>.
This causes subsequent <code>CREATE</code> statements to be executed once for each row.
In many cases this is what you want.
If that&#8217;s not intended, please move the <code>CREATE</code> statement before the <code>MATCH</code>, or change the cardinality of the query with means discussed later or use the <em>get or create</em> semantics of the next clause: <code>MERGE</code>.
</td>
</tr>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-completing-patterns"><a class="anchor" href="#cypher-intro-patterns-in-practice-completing-patterns"></a>Completing patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Whenever we get data from external systems or are not sure if certain information already exists in the graph, we want to be able to express a repeatable (idempotent) update operation.
In Cypher <code>MERGE</code> has this function.
It acts like a combination of <code>MATCH</code> <em>or</em> <code>CREATE</code>, which checks for the existence of data first before creating it.
With <code>MERGE</code> you define a pattern to be found or created.
Usually, as with <code>MATCH</code> you only want to include the key property to look for in your core pattern.
<code>MERGE</code> allows you to provide additional properties you want to set <code>ON CREATE</code>.</p>
</div>
<div class="paragraph">
<p>If we wouldn&#8217;t know if our graph already contained <em>Cloud Atlas</em> we could merge it in again.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MERGE (m:Movie { title:"Cloud Atlas" })
ON CREATE SET m.released = 2012
RETURN m</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+--------------------------------------------+
| m                                          |
+--------------------------------------------+
| Node[5]{title:"Cloud Atlas",released:2012} |
+--------------------------------------------+
1 row</pre>
</div>
</div>
<div class="paragraph">
<p>We get a result in any both cases: either the data (potentially more than one row) that was already in the graph or a single, newly created <code>Movie</code> node.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
A <code>MERGE</code> clause without any previously assigned variables in it either matches the full pattern or creates the full pattern.
It never produces a partial mix of matching and creating within a pattern.
To achieve a partial match/create, make sure to use already defined variables for the parts that shouldn&#8217;t be affected.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>So foremost <code>MERGE</code> makes sure that you can&#8217;t create duplicate information or structures, but it comes with the cost of needing to check for existing matches first.
Especially on large graphs it can be costly to scan a large set of labeled nodes for a certain property.
You can alleviate some of that by creating supporting indexes or constraints, which we&#8217;ll discuss later.
But it&#8217;s still not for free, so whenever you&#8217;re sure to not create duplicate data use <code>CREATE</code> over <code>MERGE</code>.</p>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
<code>MERGE</code> can also assert that a relationship is only created once.
For that to work you <em>have to pass in</em> both nodes from a previous pattern match.
</td>
</tr>
</table>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie { title:"Cloud Atlas" })
MATCH (p:Person { name:"Tom Hanks" })
MERGE (p)-[r:ACTED_IN]-&gt;(m)
ON CREATE SET r.roles =['Zachry']
RETURN p,r,m</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>  N2 [
    label = "{Person|name = \'Tom Hanks\'\lborn = 1956\l}"
  ]
  N2 -&gt; N5 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "ACTED_IN\nroles = \[\'Zachry\'\]\l"
  ]
  N5 [
    label = "{Movie|title = \'Cloud Atlas\'\lreleased = 2012\l}"
  ]</pre>
</div>
</div>
<div class="paragraph">
<p>In case the direction of a relationship is arbitrary, you can leave off the arrowhead.
<code>MERGE</code> will then check for the relationship in either direction, and create a new directed relationship if no matching relationship was found.</p>
</div>
<div class="paragraph">
<p>If you choose to pass in only one node from a preceding clause, <code>MERGE</code> offers an interesting functionality.
It will then only match within the direct neighborhood of the provided node for the given pattern, and, if not found create it.
This can come in very handy for creating for example tree structures.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (y:Year { year:2014 })
MERGE (y)&lt;-[:IN_YEAR]-(m10:Month { month:10 })
MERGE (y)&lt;-[:IN_YEAR]-(m11:Month { month:11 })
RETURN y,m10,m11</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the graph structure that gets created:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N6 [
    label = "{Year|year = 2014\l}"
  ]
  N8 -&gt; N6 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "IN_YEAR\n"
  ]
  N7 -&gt; N6 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "IN_YEAR\n"
  ]
  N7 [
    label = "{Month|month = 10\l}"
  ]
  N8 [
    label = "{Month|month = 11\l}"
  ]</pre>
</div>
</div>
<div class="paragraph">
<p>Here there is no global search for the two <code>Month</code> nodes; they are only searched for in the context of the <em>2014</em> <code>Year</code> node.</p>
</div>
<p class="cypherdoc-console"></p>
</div>
</div>
</article>
<aside class="toc sidebar" data-title="Contents" data-levels="2">
  <div class="toc-menu"></div>
</aside>
<div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                id="Shape"></path>
            <circle id="Oval" cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                id="Shape"></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" id="Shape"></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                id="Shape"></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" id="Shape"></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                id="Shape"></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                id="Shape"></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes">
            <circle id="Oval" cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                id="Shape"></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                id="Shape"></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                id="Shape"></path>
        </svg>
    </div>


</div>  </div>
</main>
</div>
<footer class="footer">
  <div class="column">
    <div class="logo-footer"></div>
    <p>© <span id="footer-copyright-year">2020</span> Neo4j, Inc.<br>
      <a href="/terms/">Terms</a> | <a href="/privacy-policy/">Privacy </a> | <a href="/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup>®</sup>, Neo Technology<sup>®</sup>, Cypher<sup>®</sup>, Neo4j<sup>®</sup> Bloom<sup>™</sup> and
      Neo4j<sup>®</sup> Aura<sup>™</sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <a href="/contact-us?ref=footer">Contact Us →</a>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 8 05 08 03 44<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
</footer><script src="https://d3js.org/d3-dispatch.v1.min.js"></script>
<script src="https://d3js.org/d3-quadtree.v1.min.js"></script>
<script src="https://d3js.org/d3-timer.v1.min.js"></script>
<script src="https://d3js.org/d3-force.v2.min.js"></script>

<script src="../../../_/js/site.js"></script>
<script async src="../../../_/js/vendor/gram.js"></script>
<script async src="../../../_/js/vendor/highlight.js"></script>
<script async src="../../../_/js/vendor/search.js"></script>  </body>
</html>
