<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width,initial-scale=1">
    <title>Getting the correct results :: Neo4j Labs Docs</title>
    <link rel="stylesheet" href="../../../_/css/site.css">
  </head>
  <body class="article docs">
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/labs/docs">
        <svg width="97px" height="36px" viewBox="0 0 97 36" class="logo">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g transform="translate(0.000000, 1.000000)" fill-rule="nonzero">
              <g>
                <path
                  d="M28.7331787,15.4086598 C28.7331787,23.4004124 22.3016241,29.8779381 14.3665893,29.8779381 C6.43155452,29.8779381 0,23.4004124 0,15.4086598 C0,7.41690722 6.43155452,0.939375765 14.3665893,0.939375765 C22.3016241,0.932371134 28.7331787,7.41690722 28.7331787,15.4086598"
                  fill="#008CC1"></path>
                <path
                  d="M6.36890951,10.6626804 C6.36890951,11.3006186 5.85382831,11.8193814 5.22041763,11.8193814 C4.58700696,11.8193814 4.07192575,11.3006186 4.07192575,10.6626804 C4.07192575,10.0247423 4.58700696,9.50597938 5.22041763,9.50597938 C5.86078886,9.50597938 6.36890951,10.0247423 6.36890951,10.6626804"
                  fill="#FFFFFF"></path>
                <path
                  d="M6.5638051,13.8383505 C6.5638051,14.4762887 6.0487239,14.9950515 5.41531323,14.9950515 C4.78190255,14.9950515 4.26682135,14.4762887 4.26682135,13.8383505 C4.26682135,13.2004124 4.78190255,12.6816495 5.41531323,12.6816495 C6.0487239,12.6816495 6.5638051,13.1934021 6.5638051,13.8383505"
                  fill="#FFFFFF"></path>
                <path
                  d="M7.26682135,17.203299 C7.26682135,17.8412371 6.75174014,18.36 6.11832947,18.36 C5.48491879,18.36 4.96983759,17.8412371 4.96983759,17.203299 C4.96983759,16.5653608 5.48491879,16.0465979 6.11832947,16.0465979 C6.75174014,16.0395876 7.26682135,16.5583505 7.26682135,17.203299"
                  fill="#FFFFFF"></path>
                <path
                  d="M8.83990719,20.217732 C8.83990719,20.8556701 8.32482599,21.374433 7.69141531,21.374433 C7.05800464,21.374433 6.54292343,20.8556701 6.54292343,20.217732 C6.54292343,19.5797938 7.05800464,19.0610309 7.69141531,19.0610309 C8.32482599,19.0540206 8.83990719,19.5727835 8.83990719,20.217732"
                  fill="#FFFFFF"></path>
                <path
                  d="M21.1392111,24.4309278 C21.1392111,25.068866 20.6241299,25.5876289 19.9907193,25.5876289 C19.3573086,25.5876289 18.8422274,25.068866 18.8422274,24.4309278 C18.8422274,23.7929897 19.3573086,23.2742268 19.9907193,23.2742268 C20.6241299,23.2742268 21.1392111,23.7929897 21.1392111,24.4309278"
                  fill="#FFFFFF"></path>
                <path
                  d="M23.2273782,21.942268 C23.2273782,22.5802062 22.712297,23.0989691 22.0788863,23.0989691 C21.4454756,23.0989691 20.9303944,22.5802062 20.9303944,21.942268 C20.9303944,21.3043299 21.4454756,20.785567 22.0788863,20.785567 C22.712297,20.785567 23.2273782,21.3043299 23.2273782,21.942268"
                  fill="#FFFFFF"></path>
                <path
                  d="M17.1716937,4.34639175 C17.1716937,4.9843299 16.6566125,5.50309278 16.0232019,5.50309278 C15.3897912,5.50309278 14.87471,4.9843299 14.87471,4.34639175 C14.87471,3.70845361 15.3897912,3.18969072 16.0232019,3.18969072 C16.6566125,3.18969072 17.1716937,3.70845361 17.1716937,4.34639175"
                  fill="#FFFFFF"></path>
                <path
                  d="M14.1508121,3.28082474 C14.1508121,3.91876289 13.6357309,4.43752577 13.0023202,4.43752577 C12.3689095,4.43752577 11.8538283,3.91876289 11.8538283,3.28082474 C11.8538283,2.6428866 12.3689095,2.12412371 13.0023202,2.12412371 C13.6357309,2.12412371 14.1508121,2.6428866 14.1508121,3.28082474"
                  fill="#FFFFFF"></path>
                <ellipse id="Oval" stroke="#FFFFFF" fill="#66B245" cx="22.2946636" cy="11.9595876" rx="7.65661253"
                  ry="7.71134021"></ellipse>
                <ellipse id="Oval" stroke="#FFFFFF" fill="#66B245" cx="11.8051044" cy="27.6837113" rx="6.26450116"
                  ry="6.30927835"></ellipse>
                <ellipse id="Oval" stroke="#FFFFFF" fill="#66B245" cx="6.64733179" cy="4.20618557" rx="4.17633411"
                  ry="4.20618557"></ellipse>
              </g>
              <g id="neo4j" transform="translate(33.000000, 1.000000)" fill="#000000">
                <path
                  d="M0,4.87252125 L1.39130435,4.87252125 L1.39130435,7.6203966 C2.05913043,5.9490085 3.45043478,4.64589235 6.28869565,4.64589235 C9.51652174,4.64589235 11.6869565,6.85552408 11.6869565,10.3399433 L11.6869565,19.1501416 L10.2956522,19.1501416 L10.2956522,10.6232295 C10.2956522,7.76203966 8.57043478,5.97733711 5.9826087,5.97733711 C3.17217391,5.97733711 1.39130435,8.18696884 1.39130435,11.4730878 L1.39130435,19.1501416 L0,19.1501416 L0,4.87252125 Z">
                </path>
                <path
                  d="M14.1634783,12.0396601 C14.1634783,7.59206799 17.1408696,4.5325779 21.0086957,4.5325779 C24.8208696,4.5325779 27.52,7.73371105 27.52,11.6430595 C27.52,11.6430595 27.52,12.0679887 27.4921739,12.3512748 L15.5269565,12.3512748 C15.6104348,15.7790368 17.8643478,18.2152975 21.0643478,18.2152975 C23.68,18.2152975 25.4886957,17.082153 26.3234783,16.0056657 L26.3234783,17.6770538 C25.0156522,18.8668555 23.4295652,19.5467422 21.0643478,19.5467422 C17.0295652,19.5467422 14.1634783,16.5439093 14.1634783,12.1246459 L14.1634783,12.0396601 Z M26.0452174,11.0764873 C26.0173913,8.15864023 23.7913043,5.86402266 21.0086957,5.86402266 C18.0869565,5.86402266 15.693913,8.15864023 15.5826087,11.0764873 L26.0452174,11.0764873 Z">
                </path>
                <path
                  d="M37.0643478,4.50424929 C41.1826087,4.50424929 44.4382609,7.70538244 44.4382609,12.0113314 C44.4382609,16.3172805 41.1826087,19.5184136 37.0643478,19.5184136 C32.946087,19.5184136 29.6904348,16.3172805 29.6904348,12.0113314 C29.6904348,7.70538244 32.946087,4.50424929 37.0643478,4.50424929 Z M37.0643478,18.1869688 C40.4869565,18.1869688 43.0469565,15.5240793 43.0469565,12.0113314 C43.0469565,8.49858357 40.4869565,5.83569405 37.0643478,5.83569405 C33.6417391,5.83569405 31.0817391,8.49858357 31.0817391,12.0113314 C31.0817391,15.5240793 33.6417391,18.1869688 37.0643478,18.1869688 Z">
                </path>
                <polygon
                  points="51.7843478 4.87252125 53.3426087 4.87252125 47.3878261 17.7903683 56.0417391 17.7903683 56.0417391 13.1161473 57.4886957 13.1161473 57.4886957 24.6175637 56.0417391 24.6175637 56.0417391 19.1501416 45.1895652 19.1501416">
                </polygon>
                <path
                  d="M62.2469565,4.87252125 L63.6382609,4.87252125 L63.6382609,21.1331445 C63.6382609,24.3342776 61.8295652,24.9858357 60.0765217,24.9858357 C59.7426087,24.9858357 59.3808696,24.9575071 59.1582609,24.9008499 L59.1582609,23.5694051 C59.4921739,23.6260623 59.8817391,23.6543909 60.2156522,23.6543909 C61.6347826,23.6543909 62.2469565,22.9461756 62.2469565,21.1331445 L62.2469565,4.87252125 Z M61.9408696,1.04815864 C61.9408696,0.45325779 62.413913,0.0283286119 62.9426087,0.0283286119 C63.4713043,0.0283286119 63.9443478,0.45325779 63.9443478,1.04815864 C63.9443478,1.61473088 63.4713043,2.03966006 62.9426087,2.03966006 C62.413913,2.03966006 61.9408696,1.61473088 61.9408696,1.04815864 Z">
                </path>
              </g>
            </g>
          </g>
        </svg>

        <svg width="58px" height="34px" viewBox="0 0 58 34">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">

            <path
              d="M7.204,20.364 C10.088,20.364 12.216,18.768 12.804,17.06 L12.804,20 L14.204,20 L14.204,0.484 L12.804,0.484 L12.804,8.828 C12.216,7.12 10.088,5.524 7.204,5.524 C3.256,5.524 0.092,8.688 0.092,12.944 C0.092,17.2 3.228,20.364 7.204,20.364 Z M7.204,19.048 C3.956,19.048 1.492,16.416 1.492,12.944 C1.492,9.5 3.956,6.84 7.204,6.84 C10.48,6.84 12.972,9.388 12.972,12.944 C12.972,16.5 10.48,19.048 7.204,19.048 Z M23.416,20.364 C27.56,20.364 30.836,17.2 30.836,12.944 C30.836,8.688 27.56,5.524 23.416,5.524 C19.272,5.524 15.996,8.688 15.996,12.944 C15.996,17.2 19.272,20.364 23.416,20.364 Z M23.416,19.048 C19.972,19.048 17.396,16.416 17.396,12.944 C17.396,9.472 19.972,6.84 23.416,6.84 C26.86,6.84 29.436,9.472 29.436,12.944 C29.436,16.416 26.86,19.048 23.416,19.048 Z M40.412,20.364 C42.54,20.364 44.416,19.58 45.76,18.152 L44.92,17.2 C43.8,18.376 42.204,19.048 40.412,19.048 C36.968,19.048 34.392,16.416 34.392,12.944 C34.392,9.472 36.968,6.84 40.412,6.84 C42.204,6.84 43.8,7.512 44.92,8.688 L45.76,7.736 C44.416,6.308 42.54,5.524 40.412,5.524 C36.268,5.524 32.992,8.688 32.992,12.944 C32.992,17.2 36.268,20.364 40.412,20.364 Z M52.424,20.308 C55.588,20.308 57.156,18.46 57.156,16.416 C57.156,14.12 55.7,13.084 53.012,11.992 C51.08,11.208 49.792,10.564 49.792,8.996 C49.792,7.68 50.884,6.84 52.312,6.84 C53.572,6.84 54.384,7.372 54.916,8.324 L56.064,7.736 C55.308,6.28 54.02,5.524 52.284,5.524 C50.044,5.524 48.392,6.952 48.392,8.996 C48.392,11.264 49.96,12.16 52.144,13.084 C54.468,14.064 55.756,14.68 55.756,16.416 C55.756,17.676 54.888,18.992 52.424,18.992 C50.212,18.992 48.896,17.9 48.364,16.444 L47.188,16.892 C47.86,19.076 49.848,20.308 52.424,20.308 Z"
              id="docs" fill="#606060" fill-rule="nonzero" id="docs"></path>
          </g>
        </svg>
      </a>
      <button class="navbar-burger" data-target="topbar-nav">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
      <div class="navbar-end">

        <div class="navbar-item is-hoverable developer">
          <a class="navbar-link" href="/developer">Developer Guides</a>
        </div>
        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project" href="">
              <a class="project-name" href="">Operations Manual</a>

              <ul class="project-links">
                <li><a href="" class="project-link">Migration Guide</a></li>
                <li><a href="" class="project-link">Status Codes</a></li>
              </ul>
            </div>
            <div class="navbar-item project" href="">
              <a class="project-name" href="">Cypher Manual</a>

              <ul class="project-links">
                <li><a href="" class="project-link">Cyper Refcard</a></li>
              </ul>
            </div>
            <div class="navbar-item project" href="">
              <a class="project-name" href="">Driver Manual</a>

              <ul class="project-links">
                <li><a href="" class="project-link">Java</a></li>
                <li><a href="" class="project-link">JavaScript</a></li>
                <li><a href="" class="project-link">.NET</a></li>
                <li><a href="" class="project-link">Python</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc">APOC</a>
              <p class="project-description">A library of procedures and functions for interacting with Neo4j</p>

              <ul class="project-links">
                <li><a href="/labs/apoc/4.0" class="project-link">Documentation</a></li>
                <li><a href="/labs/apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/streams">Neo4j Streams</a>
              <p class="project-description">Integration for Neo4j &amp; Kafka</p>

              <ul class="project-links">
                <li><a href="/labs/streams/4.0" class="project-link">Documentation</a></li>
                <li><a href="/labs/streams" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics">neosemantics</a>
              <p class="project-description">An RDF Toolkit for Neo4j</p>

              <ul class="project-links">
                <li><a href="/labs/neosemantics/4.0" class="project-link">Documentation</a></li>
                <li><a href="/labs/neosemantics" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item">
          <a class="navbar-link" href="/search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" xmlns="http://www.w3.org/2000/svg"
              xmlns:xlink="http://www.w3.org/1999/xlink" class="fill-current float-right" id="search" role="button"
              title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle id="Oval"
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" id="Shape"></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header><div class="search" id="search">
    <div class="search-container">
        <form class="search-form">
            <label for="search_input">Search Neo4j.com</label>

            <input id="search_input" type="text" name="search"
                placeholder="Try &quot;MATCH clause&quot; or &quot;Monitoring Queries&quot;">
            <div class="search-icon">
                <svg width="16px" height="22px" viewBox="0 0 23 23" version="1.1" xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" class="fill-current float-right" id="submit_search"
                    role="button" title="Search Website">
                    <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                        stroke-linejoin="round">
                        <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                            <circle id="Oval"
                                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                            <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" id="Shape"></path>
                        </g>
                    </g>
                </svg>
            </div>
            <div class="search-icon">
                <svg width="14px" height="22px" viewBox="0 0 22 22" role="button" class="cancel" id="close_search">
                    <line x1="19.5833333" y1="0.416666667" x2="0.416666667" y2="19.5833333"></line>
                    <line x1="19.5833333" y1="19.5833333" x2="0.416666667" y2="0.416666667"></line>
                </svg>
            </div>
        </form>
        <div class="search-results"></div>

        <div class="search-filters hidden">
            <div class="search-filters-header">
                <h2>Filter By Category</h2>
                <div class="search-filters-icon">
                    <svg width="14px" height="22px" viewBox="0 0 22 22" role="button" class="cancel" id="close_filters">
                        <line x1="19.5833333" y1="0.416666667" x2="0.416666667" y2="19.5833333"></line>
                        <line x1="19.5833333" y1="19.5833333" x2="0.416666667" y2="0.416666667"></line>
                    </svg>
                </div>
            </div>

            <div class="search-filters-content">
            </div>
        </div>

    </div>
</div><div class="body">
<div class="nav-container" data-component="getting-started" data-version="current">
  <aside class="nav">
    <div class="panels">
<div class="nav-panel-menu is-active" data-panel="menu">
  <nav class="nav-menu">
    <h3 class="title"><a href="../index.html">Getting Started</a></h3>
<ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../index.html">The Neo4j Getting Started Guide v4.1</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../get-started-with-neo4j.html">Get started with Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../get-started-with-neo4j.html#_installing_neo4j">Installing Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../get-started-with-neo4j.html#_documentation_guide">Documentation guide</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../graphdb-concepts.html">Graph Database Concepts</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-example-graph">Example Graph</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-nodes">Nodes</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-labels">Labels</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-relationships">Relationships</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-relationship-types">Relationship Types</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-properties">Properties</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-traversal">Traversals and Paths</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-schema">Schema</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../graphdb-concepts.html#graphdb-naming-rules-and-recommendations">Naming Rules and Recommendations</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="index.html">Cypher</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="patterns.html">Patterns</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="patterns-in-practice.html">Patterns in practice</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="results.html">Getting the correct results</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="compose-statements.html">Composing large statements</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="schema.html">Defining a schema</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="load-csv.html">Import data</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
<button class="nav-toggle"></button>
<nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../index.html">Getting Started</a></li>
    <li><a href="index.html">Cypher</a></li>
    <li><a href="results.html">Getting the correct results</a></li>
  </ul>
</nav>
<div class="page-versions">
  <button class="version-menu-toggle" title="Show other versions of page">current</button>
  <div class="version-menu">
    <a class="version is-current" href="results.html">current</a>
    <a class="version" href="../../4.0/cypher-intro/results.html">4.0</a>
  </div>
</div>
  <div class="edit-this-page"><a href="file:///Users/adam/neo4j/neo4j-manual-modeling-antora/gettingStarted/modules/ROOT/pages/cypher-intro/results.adoc">Edit this Page</a></div>
</div>
  <div class="content">
<article class="doc">
<h1 class="page">Getting the correct results</h1>
<div id="preamble">
<div class="sectionbody">
<div class="quoteblock abstract">
<blockquote>
<div class="paragraph">
<p>This section describes how to manipulate the output of Cypher queries in order to get the results you are looking for.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>This section includes:</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="#cypher-intro-results-example-graph">Example graph</a></p>
</li>
<li>
<p><a href="#cypher-intro-results-filtering">Filtering results</a></p>
</li>
<li>
<p><a href="#cypher-intro-results-returning">Returning results</a></p>
</li>
<li>
<p><a href="#cypher-intro-results-aggregating">Aggregating information</a></p>
</li>
<li>
<p><a href="#cypher-intro-results-ordering-and-pagination">Ordering and pagination</a></p>
</li>
<li>
<p><a href="#cypher-intro-results-collecting-aggregation">Collecting aggregation</a></p>
</li>
</ul>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-example-graph"><a class="anchor" href="#cypher-intro-results-example-graph"></a>Example graph</h2>
<div class="sectionbody">
<div class="paragraph">
<p>First we create some data to use for our examples:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (matrix:Movie { title:"The Matrix",released:1997 })
CREATE (cloudAtlas:Movie { title:"Cloud Atlas",released:2012 })
CREATE (forrestGump:Movie { title:"Forrest Gump",released:1994 })
CREATE (keanu:Person { name:"Keanu Reeves", born:1964 })
CREATE (robert:Person { name:"Robert Zemeckis", born:1951 })
CREATE (tom:Person { name:"Tom Hanks", born:1956 })
CREATE (tom)-[:ACTED_IN { roles: ["Forrest"]}]-&gt;(forrestGump)
CREATE (tom)-[:ACTED_IN { roles: ['Zachry']}]-&gt;(cloudAtlas)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the resulting graph:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>  N0 [
    label = "Movie\ntitle = 'The Matrix'\nreleased = 1997\n"
  ]
  N1 [
    label = "Movie\ntitle = 'Cloud Atlas'\nreleased = 2012\n"
  ]
  N2 [
    label = "Movie\ntitle = 'Forrest Gump'\nreleased = 1994\n"
  ]
  N3 [
    label = "Person\nname = 'Keanu Reeves'\nborn = 1964\n"
  ]
  N4 [
    label = "Person\nname = 'Robert Zemeckis'\nborn = 1951\n"
  ]
  N4 -&gt; N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "DIRECTED\n"
  ]
  N5 [
    label = "Person\nname = 'Tom Hanks'\nborn = 1956\n"
  ]
  N5 -&gt; N1 [
    color = "#4e9a06"
    fontcolor = "#4e9a06"
    label = "ACTED_IN\nroles = ['Zachry']\n"
  ]
  N5 -&gt; N2 [
    color = "#4e9a06"
    fontcolor = "#4e9a06"
    label = "ACTED_IN\nroles = ['Forrest']\n"
  ]</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-filtering"><a class="anchor" href="#cypher-intro-results-filtering"></a>Filtering results</h2>
<div class="sectionbody">
<div class="paragraph">
<p>So far we have matched patterns in the graph and always returned all results we found.
Now we will look into options for filtering the results and only return the subset of data that we are interested in.
Those filter conditions are expressed using the <code>WHERE</code> clause.
This clause allows to use any number of boolean expressions, <em>predicates</em>, combined with <code>AND</code>, <code>OR</code>, <code>XOR</code> and <code>NOT</code>.
The simplest predicates are comparisons; especially equality.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie)
WHERE m.title = "The Matrix"
RETURN m</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+------------------------------------------------+
| m                                              |
+------------------------------------------------+
| (:Movie {title: "The Matrix", released: 1997}) |
+------------------------------------------------+

1 row</pre>
</div>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
<div class="paragraph">
<p>The query above, using the <code>WHERE</code> clause, is equivalent to this query which includes the condition in the pattern matching:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie { title: "The Matrix" })
RETURN m</code></pre>
</div>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>Other options are numeric comparisons, matching regular expressions, and checking the existence of values within a list.</p>
</div>
<div class="paragraph">
<p>The <code>WHERE</code> clause in the following example includes a regular expression match, a greater-than comparison, and a test to see if a value exists in a list:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
WHERE p.name =~ "K.+" OR m.released &gt; 2000 OR "Neo" IN r.roles
RETURN p,r,m</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+-------------------------------------------------------------------------------------------------------------------------------+
| p                                         | r                               | m                                               |
+-------------------------------------------------------------------------------------------------------------------------------+
| (:Person {name: "Tom Hanks", born: 1956}) | [:ACTED_IN {roles: ["Zachry"]}] | (:Movie {title: "Cloud Atlas", released: 2012}) |
+-------------------------------------------------------------------------------------------------------------------------------+

1 row</pre>
</div>
</div>
<div class="paragraph">
<p>An advanced aspect is that patterns can be used as predicates.
Where <code>MATCH</code> expands the number and shape of patterns matched, a pattern predicate restricts the current result set.
It only allows the paths to pass that satisfy the specified pattern.
As we can expect, the use of <code>NOT</code> only allows the paths to pass that do <em>not</em> satisfy the specified pattern.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)-[:ACTED_IN]-&gt;(m)
WHERE NOT (p)-[:DIRECTED]-&gt;()
RETURN p,m</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+----------------------------------------------------------------------------------------------+
| p                                         | m                                                |
+----------------------------------------------------------------------------------------------+
| (:Person {name: "Tom Hanks", born: 1956}) | (:Movie {title: "Cloud Atlas", released: 2012})  |
| (:Person {name: "Tom Hanks", born: 1956}) | (:Movie {title: "Forrest Gump", released: 1994}) |
+----------------------------------------------------------------------------------------------+

2 rows</pre>
</div>
</div>
<div class="paragraph">
<p>Here we find actors, because they sport an <code>ACTED_IN</code> relationship but then skip those that ever <code>DIRECTED</code> any movie.</p>
</div>
<div class="paragraph">
<p>There are more advanced ways of filtering, for example <em>list predicates</em>, which we will discuss later in this section.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-returning"><a class="anchor" href="#cypher-intro-results-returning"></a>Returning results</h2>
<div class="sectionbody">
<div class="paragraph">
<p>So far, we have returned nodes, relationships and paths directly via their variables.
However, the <code>RETURN</code> clause can return any number of expressions.
But what are expressions in Cypher?</p>
</div>
<div class="paragraph">
<p>The simplest expressions are literal values.
Examples of literal values are: numbers, strings, arrays (for example: <code>[1,2,3]</code>), and maps (for example: <code>{name:"Tom Hanks", born:1964, movies:["Forrest Gump", &#8230;&#8203;], count:13}</code>).
Individual properties of any node, relationship or map can be accessed using the <em>dot syntax</em>, for example: <code>n.name</code>.
Individual elements or slices of arrays can be retrieved with subscripts, for example: <code>names[0]</code> and <code>movies[1..-1]</code>.
Each function evaluation, for example: <code>length(array)</code>, <code>toInteger("12")</code>, <code>substring("2014-07-01",0,4)</code> and <code>coalesce(p.nickname,"n/a")</code>, is also an expression.</p>
</div>
<div class="paragraph">
<p>Predicates used in <code>WHERE</code> clauses count as <em>boolean expressions</em>.</p>
</div>
<div class="paragraph">
<p>Simple expressions can be composed and concatenated to form more complex expressions.</p>
</div>
<div class="paragraph">
<p>By default the expression itself will be used as label for the column, in many cases you want to alias that with a more understandable name using <code>expression AS alias</code>.
The alias can be used subsequently to refer to that column.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)
RETURN p, p.name AS name, toUpper(p.name), coalesce(p.nickname,"n/a") AS nickname,
  { name: p.name, label:head(labels(p))} AS person</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+-------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                               | name              | toUpper(p.name)   | nickname | person                                     |
+-------------------------------------------------------------------------------------------------------------------------------------------------+
| (:Person {name: "Keanu Reeves", born: 1964})    | "Keanu Reeves"    | "KEANU REEVES"    | "n/a"    | {name: "Keanu Reeves", label: "Person"}    |
| (:Person {name: "Robert Zemeckis", born: 1951}) | "Robert Zemeckis" | "ROBERT ZEMECKIS" | "n/a"    | {name: "Robert Zemeckis", label: "Person"} |
| (:Person {name: "Tom Hanks", born: 1956})       | "Tom Hanks"       | "TOM HANKS"       | "n/a"    | {name: "Tom Hanks", label: "Person"}       |
+-------------------------------------------------------------------------------------------------------------------------------------------------+

3 rows</pre>
</div>
</div>
<div class="paragraph">
<p>If we wish to display only unique results we can use the <code>DISTINCT</code> keyword after <code>RETURN</code>:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n)
RETURN DISTINCT labels(n) AS Labels</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+------------+
| Labels     |
+------------+
| ["Movie"]  |
| ["Person"] |
+------------+

2 rows</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-aggregating"><a class="anchor" href="#cypher-intro-results-aggregating"></a>Aggregating information</h2>
<div class="sectionbody">
<div class="paragraph">
<p>In many cases we wish to aggregate or group the data encountered while traversing patterns in our graph.
In Cypher, aggregation happens in the <code>RETURN</code> clause while computing the final results.
Many common aggregation functions are supported, e.g. <code>count</code>, <code>sum</code>, <code>avg</code>, <code>min</code>, and <code>max</code>, but there are several more.</p>
</div>
<div class="paragraph">
<p>Counting the number of people in your database could be achieved by this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Person)
RETURN count(*) AS people</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+--------+
| people |
+--------+
| 3      |
+--------+
1 row</pre>
</div>
</div>
<div class="paragraph">
<p>Note that <code>NULL</code> values are skipped during aggregation.
For aggregating only unique values use <code>DISTINCT</code>, for example: <code>count(DISTINCT role)</code>.</p>
</div>
<div class="paragraph">
<p>Aggregation works implicitly in Cypher.
We specify which result columns we wish to aggregate.
Cypher will use all non-aggregated columns as grouping keys.</p>
</div>
<div class="paragraph">
<p>Aggregation affects which data is still visible in ordering or later query parts.</p>
</div>
<div class="paragraph">
<p>The following statement finds out how often an actor and director have worked together:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)&lt;-[:DIRECTED]-(director:Person)
RETURN actor, director, count(*) AS collaborations</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+--------------------------------------------------------------------------------------------------------------+
| actor                                     | director                                        | collaborations |
+--------------------------------------------------------------------------------------------------------------+
| (:Person {name: "Tom Hanks", born: 1956}) | (:Person {name: "Robert Zemeckis", born: 1951}) | 1              |
+--------------------------------------------------------------------------------------------------------------+

1 row</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-ordering-and-pagination"><a class="anchor" href="#cypher-intro-results-ordering-and-pagination"></a>Ordering and pagination</h2>
<div class="sectionbody">
<div class="paragraph">
<p>It is common to sort and paginate after aggregating using <code>count(x)</code>.</p>
</div>
<div class="paragraph">
<p>Ordering is done using the <code>ORDER BY expression [ASC|DESC]</code> clause.
The expression can be any expression, as long as it is computable from the returned information.</p>
</div>
<div class="paragraph">
<p>For instance, if we return <code>person.name</code> we can still <code>ORDER BY person.age</code> since both are accessible from the <code>person</code> reference.
We cannot order by things that are not returned.
This is especially important with aggregation and <code>DISTINCT</code> return values, since both remove the visibility of data that is aggregated.</p>
</div>
<div class="paragraph">
<p>Pagination is done using the <code>SKIP +{{offset}}+</code> and <code>LIMIT +{count}+</code> clauses.</p>
</div>
<div class="paragraph">
<p>A common pattern is to aggregate for a count (<em>score</em> or <em>frequency</em>), order by it, and only return the top-n entries.</p>
</div>
<div class="paragraph">
<p>For instance to find the most prolific actors we could do:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)
RETURN a, count(*) AS appearances
ORDER BY appearances DESC LIMIT 10;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+---------------------------------------------------------+
| a                                         | appearances |
+---------------------------------------------------------+
| (:Person {name: "Tom Hanks", born: 1956}) | 2           |
+---------------------------------------------------------+

1 row</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-collecting-aggregation"><a class="anchor" href="#cypher-intro-results-collecting-aggregation"></a>Collecting aggregation</h2>
<div class="sectionbody">
<div class="paragraph">
<p>A very helpful aggregation function is <code>collect()</code>, which collects all the aggregated values into a list.
This is very useful in many situations, since no information of details is lost while aggregating.</p>
</div>
<div class="paragraph">
<p><code>collect()</code> is well-suited for retrieving typical parent-child structures, where one core entity (<em>parent</em>, <em>root</em> or <em>head</em>) is returned per row with all its dependent information in associated lists created with <code>collect()</code>.
This means that there is no need to repeat the parent information for each child row, or running <code>n+1</code> statements to retrieve the parent and its children individually.</p>
</div>
<div class="paragraph">
<p>The following statement could be used to retrieve the cast of each movie in our database:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+-----------------------------------------+
| movie          | cast          | actors |
+-----------------------------------------+
| "Forrest Gump" | ["Tom Hanks"] | 1      |
| "Cloud Atlas"  | ["Tom Hanks"] | 1      |
+-----------------------------------------+

2 rows</pre>
</div>
</div>
<div class="paragraph">
<p>The lists created by <code>collect()</code> can either be used from the client consuming the Cypher results, or directly within a statement with any of the list functions or predicates.</p>
</div>
</div>
</div>
</article>
<aside class="toc sidebar" data-title="Contents" data-levels="2">
  <div class="toc-menu"></div>
</aside>
<div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                id="Shape"></path>
            <circle id="Oval" cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                id="Shape"></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" id="Shape"></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                id="Shape"></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" id="Shape"></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                id="Shape"></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                id="Shape"></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes">
            <circle id="Oval" cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                id="Shape"></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                id="Shape"></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                id="Shape"></path>
        </svg>
    </div>


</div>  </div>
</main>
</div>
<footer class="footer">
  <div class="column">
    <div class="logo-footer"></div>
    <p>© <span id="footer-copyright-year">2020</span> Neo4j, Inc.<br>
      <a href="/terms/">Terms</a> | <a href="/privacy-policy/">Privacy </a> | <a href="/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup>®</sup>, Neo Technology<sup>®</sup>, Cypher<sup>®</sup>, Neo4j<sup>®</sup> Bloom<sup>™</sup> and
      Neo4j<sup>®</sup> Aura<sup>™</sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <a href="/contact-us?ref=footer">Contact Us →</a>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 8 05 08 03 44<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
</footer><script src="https://d3js.org/d3-dispatch.v1.min.js"></script>
<script src="https://d3js.org/d3-quadtree.v1.min.js"></script>
<script src="https://d3js.org/d3-timer.v1.min.js"></script>
<script src="https://d3js.org/d3-force.v2.min.js"></script>

<script src="../../../_/js/site.js"></script>
<script async src="../../../_/js/vendor/gram.js"></script>
<script async src="../../../_/js/vendor/highlight.js"></script>
<script async src="../../../_/js/vendor/search.js"></script>  </body>
</html>
